schedule/sports.tex
% Created 2019-05-30 Thu 11:26
% Intended LaTeX compiler: pdflatex
\documentclass{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\author{Tartans}
\date{\today}
\title{SPORTS}
\hypersetup{
 pdfauthor={Tartans},
 pdftitle={SPORTS},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.2 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{May 14, 2019}
\label{sec:org01bf41e}
\subsection{Sports Camp}
\label{sec:orgb165e96}
\subsubsection{LOGISTICS}
\label{sec:orgd6fb370}
\begin{itemize}
\item 16 students
\item Some CMU students, very diverse group
\item June 3 - July 26
\item 9:30-11am lectures
\item Speaker/meeting lunches
\item 12-1:30 R tutorials
\end{itemize}
\subsubsection{PLANNING}
\label{sec:org461e5f2}
\begin{itemize}
\item Regression, classification, clustering, graph techniques,
\item dplyr and ggplot
\item Guest lectures every week
\end{itemize}
\subsubsection{ROLES}
\label{sec:org53a24cf}
\begin{itemize}
\item Rebecca is the facilitator
\item CPM is the lecturer for the mornings
\item TAs learn to code, working through problems
\item Projects are hockey, football, baseball, and perhaps a tennis
\item The final result is a poster or presentation
\item Intro to R lessons
\item Fewer lessons as camp progresses
\end{itemize}
\subsubsection{TOPICS}
\label{sec:org271b8af}
\subsubsection{Vis}
\label{sec:orgfc2161c}
\begin{itemize}
\item hex charts, scatter plots, faceting, ggplot, dplyr, time series,
\item 350 crash course
\item first two weeks - vis, data exploration
\item next two weeks - regression -> clustering -> data mining
\item short, weekly presentations from the students
\end{itemize}
\subsubsection{{\bfseries\sffamily TODO} }
\label{sec:orgdbcab21}
\begin{itemize}
\item Find and collect intro to R materials
\item Set up a google drive
\item Get materials for May 22
\end{itemize}
\section{May 22, 2019}
\label{sec:org19eab32}
\subsection{Tentative schedule}
\label{sec:orge3a1658}
\begin{itemize}
\item 1030am-1200pm morning lecture
\item 200pm-330pm "lab"/ practice
\item Baker Patio lunch on June 3?
\item Advertisement for projects in week 2
\item Start having guest speakers?
\end{itemize}
\subsection{Materials}
\label{sec:org9ab25b9}
\begin{itemize}
\item We are building a website to host our publicly available data
\item summer.stat.cmu.edu/cmsacamp
\item Get Ben's R lectures
\item Do more data vis
\item have a github
\end{itemize}
\subsection{Students}
\label{sec:orgecd2210}
\begin{itemize}
\item Try to split the skill sets among the groups
\item Having office hours for my group
\end{itemize}
\subsection{{\bfseries\sffamily TODO} }
\label{sec:org3fa42b8}
\begin{itemize}
\item Rebecca and Peter will work on website with CPM
\item Peter will send out 350 lectures
\item Ron will get data sets by end of week
\item Alden and Shannon meeting on Friday to develop lab materials
\item Get the github set up
\item Meet next Wednesday
\end{itemize}
\section{May 24, 2019}
\label{sec:org7e08f00}
\subsection{Intro to R}
\label{sec:org67289e7}
\subsection{Graphics}
\label{sec:org6939f72}
\subsection{Modeling}
\label{sec:orgf1cd13f}
\subsection{Shannon}
\label{sec:org743587d}
\begin{itemize}
\item Takes two lectures on graphics for Wednesday
\end{itemize}
\section{May 29, 2019}
\label{sec:org783193e}
\begin{itemize}
\item Planning out first week and a half
\item Talk about projects the second Monday
\end{itemize}
\subsection{Schedule}
\label{sec:org22759bf}
\subsubsection{Week 1}
\label{sec:org8808697}
\begin{enumerate}
\item M
\label{sec:org8a8228d}
\begin{enumerate}
\item Lecture
\label{sec:org7e454a0}
\begin{itemize}
\item Introductions
\item Icebreakers
\item Court sports
\end{itemize}
\item Lab
\label{sec:orgc32c1d6}
\begin{itemize}
\item Install R
\end{itemize}
\end{enumerate}

\item T
\label{sec:orgd882df0}
\begin{enumerate}
\item Lecture
\label{sec:org17cee06}
\begin{itemize}
\item 1d
\end{itemize}
\item Lab
\label{sec:orgb213c1d}
\begin{itemize}
\item vis lab 1
\end{itemize}
\end{enumerate}
\item W
\label{sec:org2ae34f8}
\begin{enumerate}
\item Lecture
\label{sec:org8b3c814}
\begin{itemize}
\item 1d day 2
\end{itemize}
\item Lab
\label{sec:org0ba9b10}
\begin{itemize}
\item Dplyr lab
\end{itemize}
\end{enumerate}
\item TH
\label{sec:org178982a}
\begin{enumerate}
\item Lecture
\label{sec:org915de8c}
\begin{itemize}
\item 2d day 1
\end{itemize}
\item Lab
\label{sec:org354fecd}
\begin{itemize}
\item vis lab 2
\end{itemize}
\end{enumerate}
\item F
\label{sec:orgac14551}
\begin{enumerate}
\item Lecture
\label{sec:orgde7c899}
\begin{itemize}
\item 2d day 2
\end{itemize}
\item Lab
\label{sec:org33b0672}
\begin{itemize}
\item vis lab 3
\end{itemize}
\end{enumerate}
\end{enumerate}
\subsubsection{Week 2}
\label{sec:orgfebe8c6}
\begin{enumerate}
\item M
\label{sec:orgcd06170}
\begin{enumerate}
\item Lecture
\label{sec:org05d93b0}
\begin{itemize}
\item Intro project presentations
\end{itemize}
\item Lab
\label{sec:orgacaa997}
\begin{itemize}
\item Case study 1 (step through sports articles)
\end{itemize}
\end{enumerate}
\item T
\label{sec:org82c452e}
\begin{enumerate}
\item Lecture
\label{sec:orgaa39fff}
\begin{itemize}
\item faceting/grouping
\end{itemize}
\item Lab
\label{sec:org9f348a5}
\begin{itemize}
\item vis lab 4
\end{itemize}
\end{enumerate}
\item W
\label{sec:org9a36b8a}
\begin{enumerate}
\item Lecture
\label{sec:orgd7829e5}
\begin{itemize}
\item Simple Linear regression
\item Multiple linear regression
\item Interpretations
\item Significance
\item Diagnostics
\end{itemize}
\item Lab
\label{sec:org25f365f}
\begin{itemize}
\item Regression lab 1 (Alden's)
\end{itemize}
\end{enumerate}
\item TH
\label{sec:org7986162}
\begin{enumerate}
\item Lecture
\label{sec:orgabaeb2a}
\begin{itemize}
\item Regression lecture 2
\end{itemize}
\item Lab
\label{sec:org2c6f570}
\begin{itemize}
\item Regression lab 2
\end{itemize}
\end{enumerate}
\item F
\label{sec:org747d446}
\begin{enumerate}
\item Lecture
\label{sec:orgc159e40}
\begin{itemize}
\item Regression 3
\end{itemize}
\item Lab
\label{sec:orgfd18447}
\begin{itemize}
\item Catch up day?
\end{itemize}
\end{enumerate}
\end{enumerate}
\subsection{Sports data vis}
\label{sec:orgaccbc28}
\begin{itemize}
\item Heat maps
\item hexagons
\item time series plots
\item get 2d location data
\end{itemize}
\end{document}